<template>
  <div class="privacy-terms p-3">
    <p class="font-weight-bold mt-2" v-if="mode==='privacy' || mode==='terms'">非常歡迎您光臨「合華科技股份有限公司  DATACOM TECHNOLOGY CORP. 網站」（以下簡稱本網站），本網站為了讓您能夠安心使用本網站的各項服務與資訊，特此向您說明本網站的{{ mode === 'privacy' ? '隱私權保護政策':'使用政策'}}，以保障您的權益，請您詳閱下列內容：</p>
    <template v-if="mode==='privacy'">
      <h4>一、隱私權保護政策的適用範圍</h4>
      <p>隱私權保護政策內容，包括本網站如何處理在您使用網站服務時收集到的個人識別資料。隱私權保護政策不適用於本網站以外的相關連結網站，也不適用於非本網站所委託或參與管理的人員。</p>
      <h4>二、個人資料的蒐集、處理及利用方式</h4>
      <p>當您造訪本網站或使用本網站所提供之功能服務時，我們將視該服務功能性質，請您提供必要的個人資料，並在該特定目的範圍內處理及利用您的個人資料；非經您書面同意，本網站不會將個人資料用於其他用途。本網站在您使用服務信箱、問卷調查等互動性功能時，會保留您所提供的姓名、電子郵件地址、聯絡方式及使用時間等。於一般瀏覽時，伺服器會自行記錄相關行徑，包括您使用連線設備的IP位址、使用時間、使用的瀏覽器、瀏覽及點選資料記錄等，做為我們增進網站服務的參考依據，此記錄為內部應用，決不對外公佈。為提供精確的服務，我們會將收集的問卷調查內容進行統計與分析，分析結果之統計數據或說明文字呈現，除供內部研究外，我們會視需要公佈統計數據及說明文字，但不涉及特定個人之資料。</p>
      <h4>三、資料之保護</h4>
      <p>本網站主機均設有防火牆、防毒系統等相關的各項資訊安全設備及必要的安全防護措施，加以保護網站及您的個人資料採用嚴格的保護措施，只由經過授權的人員才能接觸您的個人資料，相關處理人員皆簽有保密合約，如有違反保密義務者，將會受到相關的法律處分。如因業務需要有必要委託其他單位提供服務時，本網站亦會嚴格要求其遵守保密義務，並且採取必要檢查程序以確定其將確實遵守。</p>
      <h4>四、網站對外的相關連結</h4>
      <p>本網站的網頁提供其他網站的網路連結，您也可經由本網站所提供的連結，點選進入其他網站。但該連結網站不適用本網站的隱私權保護政策，您必須參考該連結網站中的隱私權保護政策。</p>
      <h4>五、與第三人共用個人資料之政策</h4>
      <p>本網站絕不會提供、交換、出租或出售任何您的個人資料給其他個人、團體、私人企業或公務機關，但有法律依據或合約義務者，不在此限。<br />
          前項但書之情形包括不限於：<br />
          經由您書面同意。<br />
          法律明文規定。<br />
          為免除您生命、身體、自由或財產上之危險。<br />
          與公務機關或學術研究機構合作，基於公共利益為統計或學術研究而有必要，且資料經過提供者處理或蒐集著依其揭露方式無從識別特定之當事人。當您在網站的行為，違反服務條款或可能損害或妨礙網站與其他使用者權益或導致任何人遭受損害時，經網站管理單位研析揭露您的個人資料是為了辨識、聯絡或採取法律行動所必要者。有利於您的權益。本網站委託廠商協助蒐集、處理或利用您的個人資料時，將對委外廠商或個人善盡監督管理之責。</p>
      <h4>六、Cookie之使用</h4>
      <p>為了提供您最佳的服務，本網站會在您的電腦中放置並取用我們的Cookie，若您不願接受Cookie的寫入，您可在您使用的瀏覽器功能項中設定隱私權等級為高，即可拒絕Cookie的寫入，但可能會導至網站某些功能無法正常執行 。</p>
      <h4>七、隱私權保護政策之修正</h4>
      <p>本網站隱私權保護政策將因應需求隨時進行修正，修正後的條款將刊登於網站上。</p>


    </template>

    <template v-if="mode==='terms'">
      
      <h4>1. 關於《使用條款》</h4>
      <div class="pl-2 d-flex">
        <div class="pr-1">1)</div>
        <div>在您決定使用本網站所提供的服務(以下簡稱本服務)前，請仔細閱讀本使用條款。您必須在完全同意以下條款的前提下，才能使用本服務。本使用條款與其他附加條件或其他特殊條款相矛盾時，以附加條件或特殊條款為準。</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">2)</div>
        <div>本網站有權於任何時間修改或變更本使用條款之內容，您應經常查看以瞭解您當前的權利及義務。若您於本網站為任何修改或變更本使用條款後仍繼續使用本服務，視為您已同意接受本使用條款之修改及變更。</div>
      </div>

      <h4>2. 服務內容</h4>
      <div class="pl-2 d-flex">
        <div class="pr-1">1)</div>
        <div>本服務的具體內容由本網站根據實際情況提供，並對其所提供之服務擁有最終解釋權。</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">2)</div>
        <div>本服務係透過網際網路提供您各項網路資訊服務，您必須自行配備上網所需的各項電腦設備，並承擔所需的費用。</div>
      </div>
      <h4>3. 授權</h4>
      <p>在本使用條款的約束下，本網站僅此授予您有限、僅供個人使用、非商業用途（家裡或工作中使用）、非專屬和不可轉讓的使用本服務。</p>

      <h4>4. 兒童及青少年之保護</h4>
      <p>網路上存有不適宜兒童及青少年接受的訊息，例如色情與暴力的訊息，兒童及青少年有可能因此受到心靈與肉體上的傷害。因此，為確保兒童及青少年使用網路的安全，並避免隱私權受到侵犯，家長（或監護人）應盡到下列義務：</p>
      <div class="pl-2 d-flex">
        <div class="pr-1">1)</div>
        <div>先檢閱各該網站是否有保護個人資料的隱私權政策，再決定是否同意提出相關的個人資料；並應持續叮嚀兒童及青少年不可洩漏自己或家人的任何資料（包括姓名、地址、電話、電子郵件信箱、照片、信用卡號等）給任何人。也不可以單獨接受網友的邀請或贈送禮物而與之見面。</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">2)</div>
        <div>謹慎選擇合適網站供兒童及青少年瀏覽。未滿十二歲之兒童上網時，應全程在旁陪伴，十二歲以上未滿十八歲之青少年上網前亦應斟酌是否給予同意。</div>
      </div>
      <h4>5. 使用者的行為</h4>
      <p>您在使用本網站服務過程中，必須遵循以下原則：</p>
      <div class="pl-2 d-flex">
        <div class="pr-1">(a)</div>
        <div>遵守中華民國有關的法律和法規；</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">(b)</div>
        <div>遵守所有與網路服務有關的網路協定、規定和程式；</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">(c)</div>
        <div>不得為任何非法目的而使用網路服務系統；</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">(d)</div>
        <div>不使用任何設備、軟體或程序，干擾或試圖干擾本網站、本網站之正常運作；</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">(e)</div>
        <div>不允許侵入、強行入侵、接通、使用或企圖侵入、接通、使用本網站伺服器及未經本網站對您發出許可的任何資料區；</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">(f)</div>
        <div>不得限制、制止其他使用者使用並享用本服務；</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">(g)</div>
        <div>如發現任何非法使用帳號或任何出現安全漏洞的情況，應立即告知本網站。</div>
      </div>
      <h4>6. 知識產權</h4>
      <div class="pl-2 d-flex">
        <div class="pr-1">1)</div>
        <div>本網站提供的服務內容(包括但不限於：文字、照片、圖形、圖像、圖表、聲音、FLASH 動畫、視頻、音頻、商標等)，均由本網站或其他相關權利人依法所擁有，並受商業形象、著作權法、商標法、公平交易法以及各類智慧財產權法之保護。</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">2)</div>
        <div>非經本網站或其他相關權利人之事先書面同意，本網站及其內容之任何部分，不能修改、複製、重製、重印、公開播送、改作、散佈、發行、公開發表及為任何非法目的。</div>
      </div>
      <div class="pl-2 d-flex">
        <div class="pr-1">3)</div>
        <div>經本網站或其他相關權利人之事先書面同意，您在修改、複製、重製、重印、公開播送、改作、散佈、發行、公開發表本網站及其內容之任何部分時，必須詳細標明本網站之名稱及網址為其資料來源。</div>
      </div>

      <h4>7. 廣告信息</h4>
      <p>本網站上如有傳播或刊載之廣告，關於其內容所展現的文字、圖片、動畫、聲音、影像或以其他方式對商品或服務之說明，都是由廣告主或廣告代理商所提供。</p>

    </template>
  </div>
</template>

<script>
export default {
  props: {
    mode: {
      type: String,
      default: 'none'
    }
  }
}

</script>

<style lang="scss" scoped>
.privacy-terms {
  color: #333;
}
h4 {
  font-size: 1.2rem;
  font-weight: bold;
  margin-top: 15px;
}
p {
  text-indent: 2rem;
}
</style>

